In [1]:
import seaborn as sns
import pandas as pd

In [2]:

tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:

# day별로 tip의 평균

tips.groupby("day",observed=True)['tip'].mean()

day
Thur    2.771452
Fri     2.734737
Sat     2.993103
Sun     3.255132
Name: tip, dtype: float64

In [4]:
tips.groupby(['day','sex'],observed=True)['tip'].mean()

day   sex
Thur  Male      2.980333
      Female    2.575625
Fri   Male      2.693000
      Female    2.781111
Sat   Male      3.083898
      Female    2.801786
Sun   Male      3.220345
      Female    3.367222
Name: tip, dtype: float64

In [5]:
tips.groupby('day',observed=True)['total_bill'].agg(['sum','mean',"max"])

          sum       mean    max
day
Thur  1096.33  17.682742  43.11
Fri    325.88  17.151579  40.17
Sat   1778.40  20.441379  50.81
Sun   1627.16  21.410000  48.17

In [6]:
tips.groupby('day',observed=True)['tip'].agg( lambda x:x.max()-x.mean()  )

day
Thur    3.928548
Fri     1.995263
Sat     7.006897
Sun     3.244868
Name: tip, dtype: float64